zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
/*-------------------------------------------------------------------------*/
/* dsPIC_PRG.cpp                                                           */
/*                                                                         */
/*  Purpose: Serial PIC Programming algorithms for dsPIC30F .              */
/*                                                                         */
/*  Author:   Wolfgang Buescher (DL4YHF)                                   */
/*     Use of this sourcecode for commercial purposes strictly forbidden ! */
/*                                                                         */
/*  Date   : 2005-11-02  (ISO 8601 format, YYYY-MM-DD)                     */
/*  State  : UNDER DEVELOPMENT - NOT REALLY TESTED YET !                   */
/*                                                                         */
/*                                                                         */
/*  Literature:                                                            */
/*    [dsPICps] = "dsPIC30F Flash Programming Specification"               */
/*                Microchip DS70102D (or later ? )                         */
/*                                                                         */
/*  Last changes :                                                         */
/*    2009-06-04:  Ported to wxWidget by Philippe Chevrier                 */
/*    2006-11-05:  Handed this file (dsPIC_PRG.cpp) over to Yves Rondeau   */
/*                 who plans to support of the dsPIC33 family in WinPic.   */
/*                 No changes by Wolfgang Buescher for a while .           */
/*    2008-05-19:  Minor changes for "intelligent" programmers .           */
/*                                                                         */
/*-------------------------------------------------------------------------*/

  // Revsion history - NEWEST entry first !
  //
  // 2005-02-18:  Tried to add support for a dsPIC30F201 after BUYING(!)
  //        a sample chip, since Microchip was unable to supply samples.
  //     Because the dsPIC programming algorithms are TOTALLY different
  //     from 16F-family, the "new" algorithms are located in dsPIC_PRG.cpp .
  //
  // 2005-07-01:  First half-way stable release
  //
  // 2005-11-02:  Fixed an issue with the magic 64k address boundry
  //              in dsPIC_STDP_ReadCodeMemory() reported by Rolf Ziegler .
  //

#include "PIC_HW.h"    // Routines to drive the programmer hardware interface
#include "Config.h"
#include <Appl.h>

#include "dsPIC_PRG.h" // header for the dsPIC programming algorithms

//----------------------------------------------------------------------------
//  Low-level stuff to communicate with the dsPIC in "STDP" mode .
//
//  "STDP" is Microchip's Standard DUT Programming protocol ,
//   which unfortunately has got NOTHING to do with the old-fashioned
//   in-circuit programming mode from the 12F- and 16F-family.
//   Instead, it's a method of shifting a MICRCONTROLLER COMMAND
//   into the microcontroller's INSTRUCTION REGISTER (!) to execute them.
//  In fact, this seems to be the only way to program a dsPIC if the
//   so-called "executive memory" is not programmed.
//  See [dsPICps] Chapter 11.  Here just a few (?) notes :
//
//  - "Fresh" dsPIC from the factory are shipped WITHOUT the "programming
//    executive" .  So "STDP" is always required, even though it may be
//    utterly slow because A LOT OF MACHINE CODE INSTRUCTIONS must be
//    clocked into the dsPIC for every erase-, write-, or read-operation .
//
//  - In fact, the "executive memory" gets erased whenever doing a "bulk erase"
//    through an STDP command. So the STDP programming algorithms must be
//    implemented in first place. It is questionable that WinPic will ever
//    support the dsPIC's "ICSP" protocol which requires the executive stuff.
//
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
void dsPIC_STDP_SendCpuControlCode( uint16_t w4BitControlCode )
   // Sends a 4-bit CPU control in STDP mode as explained in Chapter 11.2 .
   // - Upon entry, the interface's CLOCK and DATA output line
   //    (which are called "PGC" and "PGD" here) must already
   //    be defined as OUTPUTS by the caller .
{ int i;
  for(i=0; i<=3; ++i)
   {
     // Notes:
     //  - The dsPIC seems to sample PGD on FALLING PGC edge .
     //  - The LSB is transmitted first .
     //  - The serial clock periods are in the XX nanosecond range,
     //    so we're safe to use 1us for the high- and low-periods here.
     //    The slow port access under WinXP will make the actual clock rate
     //    MUCH MUCH SLOWER (measured:  ~ 10 us per half clock period) .
     // Note: Since the optional use of 'PortTalk' (..thanks Martin for the pointer)
     //   .. the PIC_HW_Delay_50ns() routine wait for an additional time of
     //      <iExtraClkDelay_us> microseconds  if required for the interface.
     PIC_HW_SetClockAndData(true,  w4BitControlCode & 0x0001 );
     PIC_HW_Delay_50ns();   // "P3", spec requires 15ns(!) for PGC low time
     PIC_HW_SetClockAndData(false, w4BitControlCode & 0x0001 );
     PIC_HW_Delay_50ns();   // "P3", spec requires 15ns(!) for PGC low time
     w4BitControlCode >>= 1;
   }
} // end dsPIC_STDP_SendCpuControlCode()

//----------------------------------------------------------------------------
void dsPIC_STDP_ExecuteCoreInstruction(
      uint32_t dwInstruction )  // a 24-bit dsPIC30F machine code instruction
  // From [dsPICps] Chapter 11.2.1 "SIX SERIAL INSTRUCTION EXECUTION"
  //  > The SIX control code allows execution of dsPIC30F assembly instructions.
  //  > When the SIX code is received, the CPU is suspended for 24 clock cycles
  //  > as the instruction is then clocked into the internal buffer.
  //  > Once the instruction is shifted in, the state machine allows it to be
  //  > executed over the next four clock states.
  //  > While the received instruction is executed, the state machine simul-
  //  > taneously shifts in the next 4-bit command (see figure 11-1).
{
  int i;
  uint32_t dwShiftReg;

  PIC_HW_SetClockEnable( true );     // enable PGC output on interface
  PIC_HW_SetDataEnable( true );      // enable PGD output on interface

  dsPIC_STDP_SendCpuControlCode( 0x0000 ); // send "SIX" control code = 0000b

#if( 1 )
  PIC_HW_Delay_500ns();     // Wait "P4" between 4-bit cmd and operand, required: 20ns
#else // to see a clearer gap on the oscilloscope when debugging :
  PIC_HW_Delay_us( 20 );
#endif

  // Shift out the 24-bit operand,
  //  which the prog spec calls a dsPIC30 "assembly" instruction .
  dwShiftReg = dwInstruction;
  for( i=0; i<=23; ++i )
   { // Note: LSBit shifted out to dsPIC first !
     PIC_HW_SetClockAndData(true, dwShiftReg & 1 );
     PIC_HW_Delay_500ns();   // "P1a", spec requires 20ns in STDP mode for PGC high time
     PIC_HW_SetClockAndData(false,dwShiftReg & 1 );
     PIC_HW_Delay_500ns();   // "P1b", spec requires 20ns in STDP mode for PGC low time
     dwShiftReg >>= 1;       // next bit please
   }

