zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
//  PicHw_FlushCommand( 0x0000/*Command,here: "Control Code"*/,4/*numBitsCommand*/,
//                dwInstruction/*data*/, 24/*numBitsData*/ ); // added 2008-05-19


  // For the dsPIC's side, "ExecuteAssemblyInstruction" finished here .
  // But for the "JDM programmer", we need a longer clock-low time
  //       to charge C3 to 5 volts again !
  if( PIC_HW_interface.type==PIC_INTF_TYPE_JDM2 )
   { // For the JDM programmer, turn DATA (out) off as soon as possible
     // to avoid discharging C3 (22uF) :
     PIC_HW_SetClockAndData(false, false );
     if( Config.iSlowInterface )
          PIC_HW_Delay_us( 100 );
     else PIC_HW_Delay_us( 50 );   // just imagine how many thousands of "core instructions" we need !
   } // end if < "JDM" programmer >

} // end dsPIC_STDP_ExecuteCoreInstruction()

//----------------------------------------------------------------------------
uint16_t dsPIC_STDP_ReadVISIRegister( void )
  // Reads data from the device (contents of the VISI register) in STDP mode.
  // From [dsPICps] Chapter 11.2.2 "REGOUT SERIAL INSTRUCTION EXECUTION" :
  //  > The REGOUT control code allows for data to be extracted from the
  //  > device in STDP mode. It is used to clock the contents of
  //  > the VISI register out of the device over the PGD pin.
{
 int i;
 uint16_t wResult = 0;

  PIC_HW_SetClockEnable( true );     // enable PGC output on interface
  PIC_HW_SetDataEnable( true );      // enable PGD output on interface

  dsPIC_STDP_SendCpuControlCode( 0x0001 ); // send "REGOUT" control code = 0001b
  PIC_HW_Delay_500ns();  // Wait "P4" between 4-bit cmd and operand, required: 20ns

  //  > After the REGOUT control code is received, eight clock cycles
  //  > are required to process the command. During this time, the CPU
  //  > is help idle.
  // Furthermore, looking at [dsPICps] Figure 11-2, the host
  // still treats PGD as an INPUT (to the dsPIC) during these 8 clocks.
  for( i=0; i<=7; ++i )
   {
     PIC_HW_SetClockAndData(true,  false );
     PIC_HW_Delay_500ns();  // "P1a", spec requires 20ns in STDP mode for PGC high time
     PIC_HW_SetClockAndData(false, false );
     PIC_HW_Delay_500ns();  // "P1b", spec requires 20ns in STDP mode for PGC low time
   }

//  PicHw_FlushCommand( 0x0001/*Command,here: "Control Code"*/,4/*numBitsCommand*/,
//                      0/*data*/, 8/*numBitsData*/ ); // added 2008-05-19

  // > After these eight cycles, an additional 16 cycles are required
  // > to clock the data "OUT" [WB "IN" from the programmer's point of view]
  // > The REGOUT instruction is unique because the PGD pin is an input
  // > when the control code is transmitted to the device. However,
  // > after the control code is processed, the PGD pin becomes an output
  // > as the VISI register is shifted out. After the contents of the VISI
  // > register are shifted out, PGD becomes an input again as the state
  // > machine holds the CPU idle until the next 4-bit control code
  // > is shifted in .
  PIC_HW_SetDataEnable( false ); // turn the programmer's PGD line into an INPUT
  PIC_HW_Delay_500ns();      // Wait "P5" between REGOUT and reading VISI, required: 20ns
  for( i=0; i<=15; ++i )
   {
     PIC_HW_SetClockAndData( true,   // set PGC high
       PicHw_iStateOfDataOutWhileReading); // state of data-output-line while reading
     PIC_HW_Delay_500ns();   // "P1a", spec requires 20ns in STDP mode for PGC high time
     wResult |= PIC_HW_GetDataBit() << i;  // sample data from PIC while clock=HIGH
     PIC_HW_SetClockAndData( false, PicHw_iStateOfDataOutWhileReading ); // set PGC low
     PIC_HW_Delay_500ns();   // "P1b", spec requires 20ns in STDP mode for PGC low time
   } // end for < 16 bits read from VISI register >

  PIC_HW_SetDataEnable( true ); // turn the programmer's PGD line into an OUTPUT again

  // For the dsPIC's side, "ReadVISIRegister" is finished here .
  // But for the "JDM programmer", we need a longer clock-low time
  //       to charge C3 to 5 volts again !
  if( PIC_HW_interface.type==PIC_INTF_TYPE_JDM2 )
   { // For the JDM programmer, turn DATA (out) off as soon as possible
     // to avoid discharging C3 (22uF) :
     PIC_HW_SetClockAndData(false, false );
     // some time for the JDM interface to "recharge" C3 :
     if( Config.iSlowInterface )
          PIC_HW_Delay_us( 100 );
     else PIC_HW_Delay_us( 50 );   // just imagine how many thousands of "core instructions" we need !
   } // end if < "JDM" programmer >

#if(0)
  static uint16_t wTest=0;
  wResult = wTest++;
#endif

  return wResult;
} // end dsPIC_STDP_ReadVISIRegister()


//----------------------------------------------------------------------------
bool dsPIC_EnterSTDPMode( void )
  // Enter "STDP" programming mode for dsPIC30F .
  // > The STDP mode is entered by holding PGC and PGD low,
  // > and then raising /MCLR / Vpp to high voltage .
  //
  // This is almost the same as entering "programming mode"
  // for the PIC16Fxxx-family, with
  //  Config.iNeedPowerBeforeRaisingMCLR = true ,
  // so use the routine in PIC_HW.CPP which is already complicated enough
  // due to the large variety of programming interfaces !
  // Because this *may* change, use dsPIC_EnterSTDPMode()
  // when playing with dsPIC's. Read the full story in PIC_HW.CPP !
{
  // ex: PIC_HW_ProgMode();  // raise /MCLR to 12 V while CLOCK+DATA = low .
  // Something to remember from [dsPICps] :
  // > Note 1: The sequence that places the device into STDP mode
  // >    places all unused I/O pins to the high impedance state
  // > 2: Once STDP mode is entered, the PC is set to 0x0 (the Reset vector).
  // > 3: Before leaving the Reset vector with a GOTO instruction,
  // >    two NOP instructions must be executed .

//  PHWInfo.iCurrProgAddress = 0x000000; // added 2008-05-18 for the plugin-DLLs (here: "STDP-mode" sets PC=0)

  // Added 2004-05-30, due to problems with JDM programmer with 16F877A
  //                   when programming+verify in two separate overs .......
  if( PIC_HW_interface.type==PIC_INTF_TYPE_JDM2 )
   { // In the "JDM", things may be different, because it is impossible here
     // to turn the PIC's supply voltage quickly on.
     // Here, for the dsPIC, [dsPICps] Figure 11-3 clearly shows
     //  "Vdd turned on before Vpp" . How to achieve this with the JDM interface :

      // Make sure C2 (100uF) is charged to 8 volts  and  C3 (22uF)
      // charged to 5 volts (=negative bias voltage between PIC's Vss and PC's GROUND).
      PIC_HW_SetClockAndData(false,false);  // -> RTS=-12V, DTR=-12V
      PIC_HW_SetVpp( true );                // -> TXD=+12V , charges C2 (100uF) to ~13.2 volts
         // this is quite fast, because no resistors are involved:  13V*100uF/5mA = 260ms
      PIC_HW_LongDelay_ms(260/*ms*/); // give the CPU to another thread to make windoze happy while charging C2
      // Now pull MCLR / Vpp low, so the PIC enters the RESET state .
      // Note: Not all PIC's do have a RESET necessarily, see other case below !
      PIC_HW_SetVpp( false );               // -> TXD= -12V (hard limited to -5.7V), charges C3 to 5 volts
                                            //        while C2 remains at 8 volts.
      PIC_HW_Delay_us(100); // wait a short time for the Vpp(!) switch
                            // (the PIC itself only needs to see MCLR=LOW for 2 us).
      PIC_HW_SetVpp(true);  // Now there should be a faster rise on /MCLR = "Vpp",
                            // from 0 V to almost 13 V (from the PIC's point of view).
        // For many PIC devices, this rise time must not exceed 1 MICROSECOND,
        //          which is the reason why some ultra-ugly programmers fail .
        // Measured on an oscilloscope, where GROUND is connected to the PC's ground!!
        // (even if you don't want it that way), Vpp rises from -5 to +8 volts.
      // After /MCLR rised from 0 to 12 volts..
      PIC_HW_Delay_us(2);   // wait "P7" = 2 us in STDP mode, before the 1st clock pulse

   } // end if < JDM programmer >
  else
   { //----------------------- ALL OTHER PROGRAMMERS (except "JDM") --------------------------
       // For the dsPIC in STDP mode, force PGC and PGD low while raising Vpp :
       PIC_HW_SetClockAndData(false,false);
       PIC_HW_SetClockEnable(true );  // Enable the tristate buffer outputs (PC->PIC)
       PIC_HW_SetDataEnable( true );  // (up to now, only required for AN589 programmer)
       PIC_HW_SetVpp(false);          // ensure Vpp is off
       PIC_HW_SetVdd(false);          // ensure Vdd is off
       PIC_HW_Delay_us(800);          // 800us to discharge a 100nF capacitor via 4k7
       PIC_HW_PullMclrToGnd(true);    // do tie MCLR to ground (not many adapters support this)
       // Because some "ugly style" programmers switch Vdd together with Vpp,
       // turn Vpp off for a very short time to generate a steep
       // rise on Vpp while Vdd is still present :
       if( PIC_HW_interface.wSeparateVddAndVppControl )  // 0=no, 1=yes
        {
         PIC_HW_SetVdd(true);    // turn PIC's supply voltage on
         PIC_HW_Delay_us(50);    // wait a very short time for the Vdd(!) switch
         PIC_HW_SetVpp(true);    // lift MCLR from 0 V to 13 V within 100 us
        }
       else  // Need power before raising MCLR ,  but no separate Vdd and Vpp control lines :
        {    // (like in the COM84 adapter, which has a Vpp(!) but no Vdd(!) control line)
         PIC_HW_Delay_us(20000);  // wait a short while until MCLR is really 0 volt
         PIC_HW_SetVdd(true);    // turn PIC's supply voltage on (no effect for COM84)
         PIC_HW_Delay_us(50);    // wait a very short time for the Vdd(!) switch
         PIC_HW_SetVpp(true);    // an utterly slow rise on MCLR (because of discharged cap)
         if( PicHw_fTogglingTxD )  // If there is a charge pump for "Vpp", keep toggling a bit longer...
          {
           PIC_HW_LongDelay_ms(500/*ms*/);  // while WAITING here, feed the UART's transmit buffer (!)
          }
         else // if there is NO charge pump for "Vpp", use the typical "Vpp-ON-delay",
          {   // then turn Vpp off for a short time, and turn it on to produce a FAST RISE on Vpp/MCLR:
           PIC_HW_Delay_us(200000); // time required by INTERFACE (something like 200ms)
           PIC_HW_SetVpp(false);   // Vdd(!) capacitor should be charged now,
                                   //   the next positive slope on Vpp will be steeper
           PIC_HW_Delay_us(50);    // wait a very short time for the Vpp(!) switch
           PIC_HW_SetVpp(true);    // now this should be a faster rise on /MCLR = "Vpp"
          }
        } // end < no separate Vdd and Vpp control lines >
   } // end if < not "JDM" programmer >

  // caller must not forget to turn Vpp & Vdd off after he's ready !

