zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
  return true;
} // end dsPIC_EnterSTDPMode()

//----------------------------------------------------------------------------
void dsPIC_LeaveSTDPMode( void )
{
   PIC_HW_ProgModeOff();  // programming voltage off, clock off, data high-z
}


//----------------------------------------------------------------------------
uint16_t dsPIC_STDP_Read16BitLocation( uint32_t dwSourceAddress )
  // Reads a single 16-bit memory location.
  // Based on [dsPICps] Chapter 11.13, "Reading Data Memory",
  // but simplified for reading just a single memory location,
  //  which may be DATA MEMORY,            (addr 0x7FF000 - 0x7FFFFE in dsPIC30F )
  //               CONFIGURATION MEMORY,   (addr 0xF80000 - 0xF8000E in dsPIC30F )
  //            or DEVICE ID locations     (addr 0xFF0000 - 0xFF0002 in dsPIC30F )
  // UTTERLY SLOW, but only a few dozen locations will be read with this routine.
{
 uint32_t dwOpcode;    // 24-bit machine code for dsPIC
 uint16_t  wResult;

  // NOT INCLUDED HERE:  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

//  PHWInfo.iCurrProgAddress = dwSourceAddress; // added 2008-05-18 for the plugin-DLLs


  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 2 : Initialize TBLPAG and the read pointer (W6) for TBLRD instruction
  dwOpcode = 0x200000L;             // 200xx0     // prepare opcode for MOV #x, W0
  dwOpcode |= ((dwSourceAddress>>12) & 0x000FF0); // addr bit23..16 -> opcode bit 11..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<SourceAddress23:16>, W0
  dsPIC_STDP_ExecuteCoreInstruction( 0x880190L ); // MOV  W0, TBLPAG
  dwOpcode = 0x200006L;             // 2xxxx6     // prepare opcode for MOV #x, W6
  dwOpcode |= ((dwSourceAddress<<4) & 0x0FFFF0);  // addr bit15..0 -> opcode bit 19..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<SourceAddress15:0>, W6

  // > Step 3 : Initialize the write pointer (W7)
  // >   and store a single 16-bit memory location to W0
  dsPIC_STDP_ExecuteCoreInstruction( 0xEB0380L ); // CLR      W7
  dsPIC_STDP_ExecuteCoreInstruction( 0xBA1B96L ); // TBLRDL   [W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 4 : Output W0 using the VISI register and REGOUT command
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C20L ); // MOV      W0, VISI
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  wResult = dsPIC_STDP_ReadVISIRegister();   // clock out contents of VISI register
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 5 : Reset device internal PC
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // NOT INCLUDED HERE:    dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

#if(0) // (0) = release,  (1)=TEST
  wResult = (uint16_t)dwSourceAddress; // TEST - works without a chip :)
#endif

  return wResult;

} // end dsPIC_STDP_Read16BitLocation()

//----------------------------------------------------------------------------
void dsPIC_UnlockNVMCONAndWrite(void) // Unlock NVMCON for programming, initiate write, wait, and clear WR-flag again
{
  // Unlock NVMCON for programming
  dsPIC_STDP_ExecuteCoreInstruction( 0x200558L ); // MOV #0x55, W8
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B38L ); // MOV W8, NVMKEY
  dsPIC_STDP_ExecuteCoreInstruction( 0x200AA9L ); // MOV #0xAA, W9
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B39L ); // MOV W9, NVMKEY

  // Initiate the write cycle
  dsPIC_STDP_ExecuteCoreInstruction( 0xA8E761L ); // BSET NVMCON, #WR
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // Externally time 2ms (until write-operation is complete)
  PIC_HW_Delay_us( 2000 );  // externally time 2 msec

  // Clear the WR-bit in NVMCON register to prevent accidents..
  dsPIC_STDP_ExecuteCoreInstruction( 0xA9E761L ); // BCLR NVMCON, #WR
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

} // end dsPIC_UnlockNVMCONAndWrite()



//----------------------------------------------------------------------------
bool dsPIC_STDP_EraseAll( void )  // aka "Bölk Erase"
  // Erase "everything" using STDP as explained in [dsPICps] Chapter 11.5 :
  // > The procedure for erasing program memory (all of code memory,
  // > data memory, EXECUTIVE MEMORY(!!!!), and code-protect bits)
  // > consists of setting NVMCON to 0x407F, unlocking NVMCOM for erasing,
  // > and then executing the programming cycle.
  // > This method for bulk erasing program memory only works for systems
  // > where Vdd is between 4.5 and 5.5 volts. [..]
  // > Note:   PROGRAM MEMORY MUST BE ERASED BEFORE WRITING ANY DATA
  // >         TO PROGRAM MEMORY .
{

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 2 : Set NVMCON to erase all of Program Memory
  dsPIC_STDP_ExecuteCoreInstruction( 0x2407FAL ); // MOV  #0x407F, W10
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B0AL ); // MOV  W10, NVMCON

  // > Step 3 : Unlock NVMCON for programming, +
  // > Step 4 : Initiate the erase cycle :
  dsPIC_UnlockNVMCONAndWrite(); // Unlock NVMCON for programming, initiate write, wait, and clear WR-flag again

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

  return true;  // no chance to detect "success" of this yet !

} // end dsPIC_STDP_EraseAll()


//----------------------------------------------------------------------------
bool dsPIC_STDP_ReadConfigRegs( uint32_t dwSourceAddress, // source is usually 0xF80000
        uint32_t *pdwDestBuffer,   // pointer to destination buffer (array of DWORDs! )
        uint32_t dwNrOfRegisters)  // number of locations (usually 7 config regs a 16 bit)
{
 uint32_t dwWordIndex;
// uint16_t  w;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode
  for ( dwWordIndex=0; dwWordIndex<dwNrOfRegisters; dwWordIndex++ )
   { *pdwDestBuffer++ = dsPIC_STDP_Read16BitLocation( dwSourceAddress + 2*/*!*/dwWordIndex );
#ifdef COMPILING_WINPIC
     APPL_ShowProgress( (100*dwWordIndex) / dwNrOfRegisters );
#endif
   }
  dsPIC_LeaveSTDPMode(); // leave STDP programming mode

  return true;  // no chance to detect "success" of this yet !

