zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
} // dsPIC_STDP_ReadConfigRegs()



//----------------------------------------------------------------------------
bool dsPIC_STDP_WriteConfigRegs(
        uint32_t *pdwSourceData,  // pointer to source data (array of DWORDs)
        int   iNrOfRegisters)  // number of locations (usually 7 config regs a 16 bit)
{
 int i;
 uint32_t dwOpcode;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 2 : Initialize the write pointer (W7) for the TBLWT instruction
  dsPIC_STDP_ExecuteCoreInstruction( 0x200007L ); // MOV  #0x0000, W7

  for(i=0;i<iNrOfRegisters;++i){ // steps 3..9 must usually be repeated for SEVEN config regs..

  // > Step 3 : Set NVMCON to program 1 configuration register
  dsPIC_STDP_ExecuteCoreInstruction( 0x24008AL ); // MOV  #0x4008, W10
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B0AL ); // MOV  W10, NVMCON

  // > Step 4 : Initialize the TBLPAG register
  dsPIC_STDP_ExecuteCoreInstruction( 0x200F80L ); // MOV  #0x00F8, W0
  dsPIC_STDP_ExecuteCoreInstruction( 0x880190L ); // MOV  W0, TBLPAG

  // > Step 5 : Load the configuration register data to W0
  dwOpcode = 0x200000L;             // 2xxxx0     // prepare opcode for MOV #x, W0
  dwOpcode|=((pdwSourceData[i]<<4) & 0x0FFFF0);   // config-"word" -> opcode bit 11..4
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #0xFFFF, W0 ( to clear : 0x2FFFF0L )

  // > Step 6 : Set the read pointer (W6) and load the write latch
  dsPIC_STDP_ExecuteCoreInstruction( 0xEB0300L ); // CLR  W6
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1B96L ); // TBLWTL [W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 7 : Unlock NVMCON for programming +
  // > Step 8 : Initiate the write cycle, wait, and clear WR-flag again :
  dsPIC_UnlockNVMCONAndWrite();

  // > Step 9 : Reset device internal PC
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 10: Repeat steps 3-9 until all 7 configuration registers are [[cleared]]->PROGRAMMED
    }

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

  return true;  // no chance to detect "success" of this yet !


} // dsPIC_STDP_WriteConfigRegs()


//----------------------------------------------------------------------------
bool dsPIC_STDP_ClearConfigRegisters( void )
  // Clear the dsPIC's config registers as explained in [dsPICps] Chapter 11.7 :
  // > Configuration registers are not erasable. It is recommended that
  // > all configuration register bits be cleared by programming them
  // > to 0x1 AFTER erasing program memory. [...]
{
  // Instead of implementing TWO routines from chapters 11.7 AND chapter 11.9,
  // only ONE write-routine for the config registers is implemented here.
  // To "clear" the config registers, simply write this dummy array :
  uint32_t dwSevenFFFFs[7] = { 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF,
                            0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF };
  return dsPIC_STDP_WriteConfigRegs( dwSevenFFFFs, 7 );
} // end dsPIC_STDP_ClearConfigRegisters()


//----------------------------------------------------------------------------
bool dsPIC_STDP_WriteCodeMemory(
        uint32_t dwDestAddress,   // device-internal destination address
        uint32_t *pdwSourceData,  // pointer to source data (array of DWORDs)
        uint32_t dwNrOfCodeWords) // number CODE MEMORY WORDS (here: 24 bit each)
  // Writes N locations into the CODE MEMORY .
  //   IMPORTANT: dwNrOfLocations must be a multiple of 32,
  //   because the dsPIC programming algorithms writes 32 locations per "bank".
  // From [dsPICps] Chapter 11.8,  "Writing Code Memory" (via STDP) :
  // > The procedure for writing code memory is similar to the procedure
  // > for clearing the configuration registers, except that 32 instruction
  // > "words"(a 24 bit, wb) are programmed at a time [...]
{
 int i;
 uint32_t dwOpcode;
 uint16_t  wNrOfBlocks = (dwNrOfCodeWords+31L)/32L;  // number of "blocks", 32 instructions each
 long  i32ProgressTotal;
 long i32ProgressPercent;
 bool  fResult = true;

  i32ProgressTotal = wNrOfBlocks;  // prepare calculation of progress indicator
  if(i32ProgressTotal<1) i32ProgressTotal=1;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

//  PHWInfo.iCurrProgAddress = dwDestAddress; // added 2008-05-18 for the plugin-DLLs

  while(wNrOfBlocks--) // from Step 10: "repeat steps 2-9 until all code memory is programmed"
  {

  // > Step 2 : Set NVMCON to program 32 instruction words
  dsPIC_STDP_ExecuteCoreInstruction( 0x24001AL ); // MOV  #0x4001, W10
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B0AL ); // MOV  W10, NVMCON

  for(i=0; i<=7; ++i) // from Step 6: "repeat steps 3-5 eight times" ( 8 * 4 locations)
   {

  // > Step 3 : Initialize the write pointer (W7) for TBLWT instruction
  dwOpcode = 0x200000L;             // 200xx0     // prepare opcode for MOV #x, W0
  dwOpcode |= ((dwDestAddress>>12) & 0x000FF0);   // addr bit23..16 -> opcode bit 11..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<DestinationAddress23:16>, W0
  dsPIC_STDP_ExecuteCoreInstruction( 0x880190L ); // MOV  W0, TBLPAG
  dwOpcode = 0x200007L;             // 2xxxx7     // prepare opcode for MOV #x, W7
  dwOpcode |= ((dwDestAddress<< 4) & 0x0FFFF0);   // addr bit15..0 -> opcode bit 19..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<DestinationAddress15:0>, W7

  // > Step 4 : "Initialize the read pointer (W6) and" (WB: nonsense, see step 5, but..)
  // >          Load W0:W5 with the next 4 instruction words to program
  // See [dsPICps] Figure 11-4 "Packed instruction words in W0:W5" ..
  // LSW0 = Least Significant Word (16bit) of instruction[0] to be programmed -> W0
  // MSB0 = Most  Significant Byte (8bit)  of instruction[0] to be programmed -> lower half of W1
  // LSW0 = Least Significant Word (16bit) of instruction[1] to be programmed -> W2
  // MSB1 = Most  Significant Byte (8bit)  of instruction[1] to be programmed -> upper half of W1
  // etc , up to LSW3 -> Register R5
  dwOpcode = 0x200000L;             // 2xxxx0     // prepare opcode for MOV #x, W0
  dwOpcode|=((pdwSourceData[0]<<4) & 0x0FFFF0);   // LSW0 -> opcode bit 11..4
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<LSW0>, W0
  dwOpcode = 0x200001L;             // 2xxxx1     // prepare opcode for MOV #x, W1
  dwOpcode|=((pdwSourceData[0]>>12)& 0x000FF0);   // MSB0 -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[1]>>4 )& 0x0FF000);   // MSB1 -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<MSB1:MSB0>, W1
  dwOpcode = 0x200002L;             // 2xxxx2     // prepare opcode for MOV #x, W2
  dwOpcode|=((pdwSourceData[1]<<4) & 0x0FFFF0);   // LSW1 -> opcode bit 11..4
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<LSW1>, W2
  dwOpcode = 0x200003L;             // 2xxxx3     // prepare opcode for MOV #x, W3
  dwOpcode|=((pdwSourceData[2]<<4) & 0x0FFFF0);   // LSW2 -> opcode bit 11..4
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<LSW2>, W3
  dwOpcode = 0x200004L;             // 2xxxx4     // prepare opcode for MOV #x, W4
  dwOpcode|=((pdwSourceData[2]>>12)& 0x000FF0);   // MSB2 -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[3]>>4 )& 0x0FF000);   // MSB3 -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<MSB3:MSB2>, W4
  dwOpcode = 0x200005L;             // 2xxxx5     // prepare opcode for MOV #x, W5
  dwOpcode|=((pdwSourceData[3]<<4) & 0x0FFFF0);   // LSW3 -> opcode bit 11..4
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<LSW3>, W5

  // > Step 5 : Set the read pointer (W6)
  // >          and load the (next set of) write latches
  dsPIC_STDP_ExecuteCoreInstruction( 0xEB0300L ); // CLR  W6
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB0BB6L ); // TBLWTL [W6++], [W7]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBBDBB6L ); // TBLWTL.B [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBBEBB6L ); // TBLWTL.B [W6++], [++W7]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB0BB6L ); // TBLWTL [W6++], [W7]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBBDBB6L ); // TBLWTL.B [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBBEBB6L ); // TBLWTL.B [W6++], [++W7]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP


