zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
  // > Step 6 : Repeat steps 3-5 eight times to load the write latches for 32 instructions
      pdwSourceData += 4;  // advance source pointer to the next FOUR instructions
      dwDestAddress += 8;  // advance destination address for FOUR instructions = EIGHT address steps

//      PHWInfo.iCurrProgAddress = dwDestAddress; // added 2008-05-18 for the plugin-DLLs
    } // end for

  // > Step 7 : Unlock NVMCON for programming +
  // > Step 8 : Initiate the write cycle, wait, and clear WR-flag again :
  dsPIC_UnlockNVMCONAndWrite();

  // > Step 9 : Reset device internal PC
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

#ifdef COMPILING_WINPIC
  // Update WinPic's progress indicator, very important because this routine is utterly slow !
  i32ProgressPercent = 100 * (i32ProgressTotal - wNrOfBlocks/*Left*/ ) / i32ProgressTotal;
  APPL_ShowProgress( i32ProgressPercent );
  if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
   { fResult = false;
     break;
   }
#endif

  // > Step 10: Repeat steps 2-9 until all code memory is programmed
  } // end while(wNrOfBlocks--)

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

  return fResult;

} // end dsPIC_STDP_WriteCodeMemory()


//----------------------------------------------------------------------------
bool dsPIC_STDP_ReadCodeMemory( uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfCodeWords )
  // Reads N locations (~instructions) from CODE MEMORY. See [dsPICps] Chapter 11.11 :
  // > Reading from code memory is performed by executing a series of TBLRD
  // > instructions and clocking out the data using the REGOUT command.
  // > To ensure efficient execution and facilitate verification of the
  // > programmer, four instruction words are read from the device a time.
  // > [..] To minimize the reading time, the packed instruction word format
  // > that was utilized for writing is also used for reading (Figure 11-4) .
  //
  //  NOTE:   UTTERLY SLOW !   TAKES A HALF MINUTE TO READ A dsPIC30F2010 !
{
 uint32_t dwTemp, dwOpcode;
 long  i32ProgressTotal;
 long i32ProgressPercent;
 bool  fResult = true;
 uint32_t dwNrOfQuads = (dwNrOfCodeWords+3) / 4;

  i32ProgressTotal = dwNrOfQuads;  // prepare calculation of progress indicator
  if(i32ProgressTotal<1) i32ProgressTotal=1;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

//  PHWInfo.iCurrProgAddress = dwSourceAddress; // added 2008-05-18 for the plugin-DLLs

  while(dwNrOfQuads--) // from Step 6: "repeat steps 2-5 until all desired code memory is read"
  {

  // > Step 2 : Initialize TBLPAG and the read pointer (W6) for TBLRD instruction
  //    ( 2005-11-02: moved this INSIDE the loop because of problems >64k )
  dwOpcode = 0x200000L;             // 200xx0     // prepare opcode for MOV #x, W0
  dwOpcode |= ((dwSourceAddress>>12) & 0x000FF0); // addr bit23..16 -> opcode bit 11..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<SourceAddress23:16>, W0
  dsPIC_STDP_ExecuteCoreInstruction( 0x880190L ); // MOV  W0, TBLPAG
  dwOpcode = 0x200006L;             // 2xxxx6     // prepare opcode for MOV #x, W6
  dwOpcode |= ((dwSourceAddress<<4) & 0x0FFFF0);  // addr bit15..0 -> opcode bit 19..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<SourceAddress15:0>, W6



  // > Step 3 : Initialize the write pointer (W7)
  // >   and store the next four locations of code memory to W0:W5
  // LSW0 = Least Significant Word (16bit) of instruction[0]  -> W0
  // MSB0 = Most  Significant Byte (8bit)  of instruction[0]  -> lower half of W1
  // LSW0 = Least Significant Word (16bit) of instruction[1]  -> W2
  // MSB1 = Most  Significant Byte (8bit)  of instruction[1]  -> upper half of W1
  // etc , up to LSW3 -> Register R5
  dsPIC_STDP_ExecuteCoreInstruction( 0xEB0380L ); // CLR      W7
  dsPIC_STDP_ExecuteCoreInstruction( 0xBA1B96L ); // TBLRDL   [W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBADBB6L ); // TBLRDH.B [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBADBD6L ); // TBLRDH.B [++W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBA1BB6L ); // TBLRDL   [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBA1B96L ); // TBLRDL   [W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBADBB6L ); // TBLRDH.B [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBADBD6L ); // TBLRDH.B [++W6], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBA0BB6L ); // TBLRDL.B [W6++], [W7]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP


  // > Step 4 : Output W0:W5 using the VISI register and REGOUT command
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C20L ); // MOV      W0, VISI   ; W0 = LSW0
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  pdwDestBuffer[0] = dsPIC_STDP_ReadVISIRegister();   // clock out contents of VISI register
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C21L ); // MOV      W1, VISI   ; W1 = MSB1:MSB0
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dwTemp = dsPIC_STDP_ReadVISIRegister();             // clock out contents of VISI register
  pdwDestBuffer[0] |= ( dwTemp & 0x0000FF ) << 16;    // combine LSW0 and MSB0
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C22L ); // MOV      W2, VISI   ; W2 = LSW1
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  pdwDestBuffer[1] = dsPIC_STDP_ReadVISIRegister();   // clock out contents of VISI register
  pdwDestBuffer[1] |= ( dwTemp & 0x00FF00 ) << 8 ;    // combine LSW1 and MSB1
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C23L ); // MOV      W3, VISI   ; W3 = LSW2
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  pdwDestBuffer[2] = dsPIC_STDP_ReadVISIRegister();   // clock out contents of VISI register
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C24L ); // MOV      W4, VISI   ; W4 = MSB3:MSB2
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dwTemp = dsPIC_STDP_ReadVISIRegister();             // clock out contents of VISI register
  pdwDestBuffer[2] |= ( dwTemp & 0x0000FF ) << 16;    // combine LSW2 and MSB2
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x883C25L ); // MOV      W5, VISI   ; W5 = LSW3
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  pdwDestBuffer[3] = dsPIC_STDP_ReadVISIRegister();   // clock out contents of VISI register
  pdwDestBuffer[3] |= ( dwTemp & 0x00FF00 ) << 8 ;    // combine LSW3 and MSB3
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

