zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
  // > Step 5 : Reset device internal PC
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 6 : Repeat steps 3-5 until all desired code memory is read
  pdwDestBuffer += 4;  // advance destination pointer to the next FOUR instructions = TWELVE BYTES
  dwSourceAddress+= 8; // advance source address BY EIGHT(!) for these TWELVE BYTES(!)
      // Note the ugly consequence of Microchip's mad decision
      //      to let the address increment by TWO for every THREE bytes !
//  PHWInfo.iCurrProgAddress = dwSourceAddress; // added 2008-05-18 for the plugin-DLLs

#ifdef COMPILING_WINPIC
  // Update WinPic's progress indicator, very important because this routine is utterly slow !
  i32ProgressPercent = 100 * (i32ProgressTotal - dwNrOfQuads/*Left*/ ) / i32ProgressTotal;
  APPL_ShowProgress( i32ProgressPercent );
  if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
   { fResult = false;
     break;
   }
#endif // COMPILING_WINPIC

  } // end while(dwNrOfQuads--)

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

  return fResult;

} // end dsPIC_STDP_ReadCodeMemory()


//----------------------------------------------------------------------------
bool dsPIC_STDP_ReadDataMemory( uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfBytes )
  // Reads N locations (here: BYTES!!!) from DATA MEMORY .
  // Why BYTE-WISE, since the dsPIC's DATA EEPROM is organized 16-bit wide ?
  //     For historic reasons (PIC12Fxxx, PIC16Cxx, PIC16Fxxx, ... ),
  //     and because the traders at Microchip specify the EEPROM size in
  //     BYTES , while the CODE MEMORY size is specified in INSTRUCTION WORDS.
  // Furthermore, WinPic's hex editor treats the data eeprom as 8-bit array, basta.
  //     Each entry in "dwDestBuffer" shall only receive ONE character.
  // Example for dsPIC30F2010, "1 kByte EEPROM" :
  //          dwSourceAddress=0x7FFC00, dwNrOfBytes = 1024 .
{
 bool  fResult = true;
 uint32_t dwByteIndex;
 uint16_t  w = 0;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode
  for ( dwByteIndex=0; dwByteIndex<dwNrOfBytes; dwByteIndex++ )
   { // Note: here TWO EEPROM BYTE LOCATIONS are read in a single access !
     // moved to end of loop for debugging purposes: APPL_ShowProgress( (100*i) / PIC_DeviceInfo.lDataEEPROMSizeInByte );
     if( (dwByteIndex&1) == 0)  // only "read" a WORD every 2nd over (FROM EVEN ADDRESS)
      { w = dsPIC_STDP_Read16BitLocation( dwSourceAddress );
        dwSourceAddress += 2;
      }
     else
      { w >>=8;
      }
     *pdwDestBuffer++ = w & 0x00FF;
#ifdef COMPILING_WINPIC
     APPL_ShowProgress( (100*dwByteIndex) / dwNrOfBytes );
     if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
      { fResult = false;
        break;
      }
#endif // COMPILING_WINPIC
   }
  dsPIC_LeaveSTDPMode(); // leave STDP programming mode
  return fResult;
} // end dsPIC_STDP_ReadDataMemory()

//----------------------------------------------------------------------------
bool dsPIC_STDP_WriteDataMemory(
        uint32_t dwDestAddress,   // device-internal address: DEPENDS ON EEPROM SIZE FOR dsPIC !
        uint32_t *pdwSourceData,  // pointer to source data (array of DWORDs, but only one BYTE per array element!)
        uint32_t dwNrOfBytes )    // for historic reasons: NUMBER OF BYTES(!) to be written
  // Writes N bytes into the DATA MEMORY (EEPROM) .
{
// int i;
 int iNrOfWords = ( dwNrOfBytes+1 ) / 2;
 uint16_t  wData;
 uint32_t dwOpcode;
 long  i32ProgressTotal;
 long i32ProgressPercent;
 bool  fResult = true;


#if(1)   // New routine by DL4YHF, *not* from Microchip's prog-spec , but from
  // DS70052C, Chapter 5.5.4 "Writing One Word of Data EEPROM Memory"
  i32ProgressTotal = iNrOfWords;
  if(i32ProgressTotal<1) i32ProgressTotal=1;

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

//  PHWInfo.iCurrProgAddress = dwDestAddress; // added 2008-05-18 for the plugin-DLLs


  while(iNrOfWords--) // from Step 10: "repeat steps 2-9 until all code memory is programmed"
   {

     // Here, the DATA EEPROM is programmed word-by-word,
     //  (acceptable because the 2-ms write interval is not the
     //   worst speed-limiting factor) .
     // Based on an example in the dsPIC30F2010 datasheet, DS70118E, Ch. 7.3.2 :
     // > To write a block of data EEPROM, write to all sixteen
     // > latches first, then set the NVMCON register and program the block.

     // Setup a pointer to DATA EEPROM :
     // 2FC000    MOV     #LOW_ADDR_WORD,W0
     // 2007F1    MOV     #HIGH_ADDR_BYTE,W1
     // 880191    MOV     W1,TBLPAG
     dwOpcode = 0x200000L;                           // opcode MOV #x, W0
     dwOpcode |= ((dwDestAddress<<4) & 0x0FFFF0);    // low address word -> opcode bit 19..4 (!)
     dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #LOW_ADDR_WORD, W0
     dwOpcode = 0x200001L;                           // opcode MOV #x, W1
     dwOpcode |= ((dwDestAddress>>12) & 0x000FF0);   // high address byte-> opcode bit 11..4 (!)
     dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #HIGH_ADDR_BYTE,W1
     dsPIC_STDP_ExecuteCoreInstruction( 0x880191L ); // MOV  W1, TBLPAG

     // Write data value to holding latch ..
     // 2ABCD2    MOV     #0xABCD,W2         ; Get the data (ABCD=dummy)
     // BB1802    TBLWTL  W2,[ W0++ ]        ; write data
     // Here: Combine TWO BYTES from WinPic's source buffer into one word :
     wData  =  (*pdwSourceData++) & 0x00FF;        // byte for EVEN address -> LSB
     wData |= ((*pdwSourceData++) & 0x00FF) << 8;  // byte for ODD address  -> MSB
     dwOpcode = 0x200002L | ((uint32_t)wData<<4);       // prepare opcode for MOV #x, W2
     dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV    #wData, W2
     dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
     dsPIC_STDP_ExecuteCoreInstruction( 0xBB1802L ); // TBLWTL W2,[ W0++ ]
     dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
     dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
      // Note: NVMADR captures write address from the TBLWTL instruction !

     // Setup NVMCON for programming one word to data EEPROM ...
     //  240040   MOV     #0x4004,W0         ; Select data EEPROM for single word op
     //  883B00   MOV     W0,NVMCON          ; Operate Key to allow program operation
     //  200550   MOV     #0x55,W0
     //  883B30   MOV     W0,NVMKEY          ; Write the 0x55 key
     //  200AA1   MOV     #0xAA,W1
     //  883B31   MOV     W1,NVMKEY          ; Write the 0xAA key
     //  A8E761   BSET    NVMCON,#WR         ; Start write cycle
     dsPIC_STDP_ExecuteCoreInstruction( 0x240040L); //  MOV  #0x400A,W0
     dsPIC_STDP_ExecuteCoreInstruction( 0x883B00L); //  MOV  W0,NVMCON
     // Unlock NVMCON for programming,
     // initiate the write cycle,  wait, and clear WR-flag again :
     dsPIC_UnlockNVMCONAndWrite();

