zecarlos1957/wxpic/Trunk/src/WinPicPr/dsPIC_PRG.cpp
     // Reset device internal PC
     dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
     dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

#ifdef COMPILING_WINPIC
     // Update WinPic's progress indicator, very important because this routine is utterly slow !
     i32ProgressPercent = 100 * (i32ProgressTotal - iNrOfWords ) / i32ProgressTotal;
     APPL_ShowProgress( i32ProgressPercent );
     if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
      { fResult = false;
        break;
      }
#endif

     dwDestAddress += 2;  // dsPIC address increments by TWO for each word
//     PHWInfo.iCurrProgAddress = dwDestAddress; // added 2008-05-18 for the plugin-DLLs
   } // end while(iNrOfWords--)

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)


#else //----------------------------------------------------------------

  // Original code from [dsPICps] Chapter 11.10 ...
  //   IMPORTANT: dwNrOfBytes must be a multiple of 32 ( = 16 "data words"),
  //   because the dsPIC programming algorithms writes 16 EEPROM WORDS(!) per "bank".
 uint16_t  wNrOfBlocks = (dwNrOfBytes+31)/32;  // number of "blocks", 16 words = 32 byte each
  i32ProgressTotal = wNrOfBlocks;  // prepare calculation of progress indicator
  if(i32ProgressTotal<1) i32ProgressTotal=1;


  // From [dsPICps] Chapter 11.10,  "Writing Data Memory" (via STDP) :
  // > The procedure for writing data memory is similar to the procedure
  // > for writing code memory, except that fewer words are programmed
  // > in each operation. When writing data memory, one row of data memory
  // > is programmed at a time. Each row consists of sixteen 16-bit data words.

  dsPIC_EnterSTDPMode();  // enter STDP programming mode, set PC to 0x0000 .

  // > Step 1 : Exit the reset vector
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

  // > Step 2 : Set NVMCON to program 16 data words
  dsPIC_STDP_ExecuteCoreInstruction( 0x24005AL ); // MOV  #0x4005, W10
  dsPIC_STDP_ExecuteCoreInstruction( 0x883B0AL ); // MOV  W10, NVMCON

  for(i=0; i<=3; ++i) // from Step 6: "repeat steps 3-4 four times" ( 4 * 8 bytes )
   {

  // > Step 3 : Initialize the write pointer (W7) for TBLWT instruction
  dwOpcode = 0x200000L;             // 200xx0     // prepare opcode for MOV #x, W0
  dwOpcode |= ((dwDestAddress>>12) & 0x000FF0);   // addr bit23..16 -> opcode bit 11..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<DestinationAddress23:16>, W0
  dsPIC_STDP_ExecuteCoreInstruction( 0x880190L ); // MOV  W0, TBLPAG
  dwOpcode = 0x200007L;             // 2xxxx7     // prepare opcode for MOV #x, W7
  dwOpcode |= ((dwDestAddress<< 4) & 0x0FFFF0);   // addr bit15..0 -> opcode bit 19..4 (!)
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<DestinationAddress15:0>, W7

  // > Step 4 : Load W0:W3 with the next 4 data words to program ( = 8 bytes, 8 address steps)
  dwOpcode = 0x200000L;             // 2xxxx0     // prepare opcode for MOV #x, W0
  dwOpcode|=((pdwSourceData[0]<<4) & 0x000FF0);   // BYTE[0] -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[1]<<12)& 0x0FF000);   // BYTE[1] -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<WORD0>, W0
  dwOpcode = 0x200001L;             // 2xxxx1     // prepare opcode for MOV #x, W1
  dwOpcode|=((pdwSourceData[2]<<4) & 0x000FF0);   // BYTE[2] -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[3]<<12)& 0x0FF000);   // BYTE[3] -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<WORD1>, W1
  dwOpcode = 0x200002L;             // 2xxxx2     // prepare opcode for MOV #x, W2
  dwOpcode|=((pdwSourceData[4]<<4) & 0x000FF0);   // BYTE[4] -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[5]<<12)& 0x0FF000);   // BYTE[5] -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<WORD2>, W2
  dwOpcode = 0x200003L;             // 2xxxx3     // prepare opcode for MOV #x, W3
  dwOpcode|=((pdwSourceData[6]<<4) & 0x000FF0);   // BYTE[6] -> opcode bit 11..4
  dwOpcode|=((pdwSourceData[7]<<12)& 0x0FF000);   // BYTE[7] -> opcode bit 19..12
  dsPIC_STDP_ExecuteCoreInstruction( dwOpcode );  // MOV  #<WORD3>, W3

  // > Step 5 : Set the read pointer (W6) to 0x0000 = "&W0"
  // >          and load the (next set of) write latches
  dsPIC_STDP_ExecuteCoreInstruction( 0xEB0300L ); // CLR  W6
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0xBB1BB6L ); // TBLWTL [W6++], [W7++]
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP


  // > Step 6 : Repeat steps 3-5(!) eight times to load the write latches for 16 words
      pdwSourceData += 8;  // advance source array-pointer to the next EIGHT BYTES
  // ?? dwDestAddress += 8;  // advance destination address for FOUR words = EIGHT address steps
    } // end for

  // > Step 7 : Unlock NVMCON for programming +
  // > Step 8 : Initiate the write cycle, wait, and clear WR-flag again :
  dsPIC_UnlockNVMCONAndWrite();

  // > Step 9 : Reset device internal PC
  dsPIC_STDP_ExecuteCoreInstruction( 0x040100L ); // GOTO 0x0100
  dsPIC_STDP_ExecuteCoreInstruction( 0x000000L ); // NOP

#ifdef COMPILING_WINPIC
  // Update WinPic's progress indicator, very important because this routine is utterly slow !
  i32ProgressPercent = 100 * (i32ProgressTotal - wNrOfBlocks/*Left*/ ) / i32ProgressTotal;
  APPL_ShowProgress( i32ProgressPercent );
  if( APPL_iUserBreakFlag ) // signal for any programming loop to "stop", set via ESCAPE
   { fResult = false;
     break;
   }
#endif

  // > Step 10: Repeat steps 2-9 until all data memory is programmed
  dwDestAddress += 32;  // advance destination address for next SIXTEEN WORDS ? ! ?!

  } // end while(wNrOfBlocks--)

  dsPIC_LeaveSTDPMode(); // leave STDP programming mode (to allow proper reset)

#endif // (new or old algorithm ?)


  return fResult;

} // end dsPIC_STDP_WriteDataMemory()


//----------------------------------------------------------------------------
bool dsPIC_EraseAll(void)
{
 bool fOk;
  // As long as the "programming executive" is not supported by WoBu,
  // must use the slower "STDP" method to erase the chip completely :
  fOk = dsPIC_STDP_EraseAll();       // FIRST erase "All" (not really "All"), ..
  if( fOk )
    fOk &= dsPIC_STDP_ClearConfigRegisters();  // THEN(!) clear config registers

  return fOk;
} // dsPIC_EraseAll()

//----------------------------------------------------------------------------
bool dsPIC_ReadCodeMemory( uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfCodeWords )
{ return dsPIC_STDP_ReadCodeMemory( dwSourceAddress, pdwDestBuffer, dwNrOfCodeWords );
}

//----------------------------------------------------------------------------
bool dsPIC_WriteCodeMemory( uint32_t dwDestAddress, uint32_t *pdwSourceData, uint32_t dwNrOfCodeWords )
{ return dsPIC_STDP_WriteCodeMemory( dwDestAddress, pdwSourceData, dwNrOfCodeWords );
}

//----------------------------------------------------------------------------
bool dsPIC_ReadDataMemory( uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfBytes )
{ return dsPIC_STDP_ReadDataMemory( dwSourceAddress, pdwDestBuffer, dwNrOfBytes );
}

//----------------------------------------------------------------------------
bool dsPIC_WriteDataMemory( uint32_t dwDestAddress, uint32_t *pdwSourceBuffer, uint32_t dwNrOfBytes )
{ return dsPIC_STDP_WriteDataMemory( dwDestAddress, pdwSourceBuffer, dwNrOfBytes );
}

//----------------------------------------------------------------------------
bool dsPIC_ReadConfigRegs( uint32_t dwSourceAddress, uint32_t *pdwDestBuffer, uint32_t dwNrOfRegisters )
{ return dsPIC_STDP_ReadConfigRegs( dwSourceAddress, pdwDestBuffer, dwNrOfRegisters );
}

//----------------------------------------------------------------------------
bool dsPIC_WriteConfigRegs(uint32_t dwDummyAddress, uint32_t *pdwSourceData, uint32_t dwNrOfRegisters )
{ // "dwDummyAddress" required to maintain compatibility of argument list !
  dwDummyAddress = dwDummyAddress;
  return dsPIC_STDP_WriteConfigRegs( pdwSourceData, dwNrOfRegisters );
}


// EOF < dsPIC_PRG.C >
